INSERT INTO Roles (name)
VALUES ('AUTHOR');
INSERT INTO Roles (name)
VALUES ('RESPONDENT');
INSERT INTO Roles (name)
VALUES ('ADMIN');

INSERT INTO languages (name)
VALUES ('Java');
INSERT INTO languages (name)
VALUES ('C#');
INSERT INTO languages (name)
VALUES ('Python');
INSERT INTO languages (name)
VALUES ('Typescript');

INSERT INTO categories (name)
VALUES ('Arrays');
INSERT INTO categories (name)
VALUES ('Numbers');
INSERT INTO categories (name)
VALUES ('Strings');
INSERT INTO categories (name)
VALUES ('Regex');
INSERT INTO categories (name)
VALUES ('Custom data types');
INSERT INTO categories (name)
VALUES ('Machine learning');

INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Array sorting',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        1, 1, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Find maximum and minimum',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        1, 1, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Find average value',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        1, 1, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Concat number to number without using strings',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        1, 2, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Split string by symbol',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        1, 3, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Concatenate two strings',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        1, 3, '%s');

INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Array sorting',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        2, 1, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Find maximum and minimum',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        2, 1, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Find average value',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        2, 1, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Concat number to number without using strings',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        2, 2, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Split string by symbol',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        2, 3, '%s');
INSERT INTO problems (name, description, language_id, category_id, testing_code)
VALUES ('Concatenate two strings',
        'Хочемо підкорювати киян якістю накопичення і прагнемо розвивати послуги доставки кореспонденції, закупівлю-продаж і передачу даних разом із гуртовими постачальниками. Завдяки довершеним та прогресивним продуктам та послугам, талановитим співробітникам і відповідальному ставленню до інновацій та зберігання даних',
        2, 3, '%s');

